{"config": {"layers": [{"config": {"sparse": false, "batch_input_shape": [null, 64, 64, 1], "ragged": false, "dtype": "float32", "name": "conv2d_input"}, "class_name": "InputLayer"}, {"config": {"batch_input_shape": [null, 64, 64, 1], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d", "activation": "relu", "padding": "valid", "kernel_size": [3, 3], "filters": 32, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "data_format": "channels_last", "groups": 1}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d", "dtype": "float32", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_1", "activation": "relu", "padding": "valid", "kernel_size": [3, 3], "filters": 32, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "data_format": "channels_last", "groups": 1}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "dtype": "float32", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "dtype": "float32", "data_format": "channels_last", "name": "flatten"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense", "kernel_regularizer": null, "use_bias": true, "units": 128, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "activation": "relu", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "units": 6, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "activation": "softmax", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}], "name": "sequential"}, "keras_version": "2.4.0", "class_name": "Sequential", "backend": "tensorflow"}